#+title: Cyclistic - Estudo de Caso Google Data Analytics
#+author: Isaac Dennis
#+options: ^:nil num:nil
** Análise
Ainda após a limpeza, os dados contém valores extremos. A seguinte consulta SQL exibe a duração das 10 viagens mais longas, que alcançam um tempo próximo a um dia:
#+begin_src sqlite :db ./tripdata.db :colnames yes :exports both :cache yes
SELECT ride_id, rideable_type, (ended_at - started_at) AS duration
	FROM trips_cleaned
	ORDER BY duration DESC
	LIMIT 10;
#+end_src

#+RESULTS[03046f5d4c6a55e52731c4e0c4e182e385d38db7]:
| ride_id          | rideable_type | duration (s) |
|------------------+---------------+--------------|
| B3E8F81EBA9DC2D7 | classic_bike  |      86396.0 |
| B9B1C7E60F04E51E | classic_bike  |      86395.0 |
| 5C76DFE7ED12537E | classic_bike  |      86394.0 |
| F6FF74390ED7B799 | classic_bike  |      86390.0 |
| C3E2A264DD5EB0C0 | classic_bike  |      86379.0 |
| 545671A445BDEAA7 | docked_bike   |      86374.0 |
| 99961BFCCFF02177 | docked_bike   |      86362.0 |
| E26C2BB8C5CA4446 | docked_bike   |      86343.0 |
| 98C7100253B945BC | docked_bike   |      86314.0 |
| 175623AF52567043 | docked_bike   |      86255.0 |

Devido a isso, a mediana foi utilizada como medida de tendência central. A tabela a seguir exibe a disparidade entre a mediana e a média dos dados (para uma explicação estatística do uso da mediana, leia "Introdução à Estatística Moderna", de Mine Çetinkaya-Rundel e Johanna Hardin, Capítulo 5, disponível on-line gratuitamente)[fn:1].
| membro_casual | mediana da duração (min) | média da duração (min) |
|---------------+--------------------------+------------------------|
| casual        |                       12 |                     21 |
| member        |                        9 |                     12 |

Enquanto a média exibe uma variação de 75% na duração da viagem dos clientes casuais em relação aos membros, a mediana exibe uma variação de 33%.

